<x-layout>
    <div class="flex">
        <x-sidebar-nav />

        <div class="flex-1 ml-20">
            <h1 class="text-2xl font-bold">Название теории</h1>
            <p>Здесь будет текст теории...</p>
            
            <h2 id="section1" class="text-xl font-semibold mt-6">Раздел 1</h2>
            <p>Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание 
                раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1..
                .Содержание раздела 1...Содержание раздеСодержание раздела 1...Содержание раздела 1...Содержание раздела 1...Сод
                Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содер
                жание раздела 1...Содержание раздела 1...Содержание разделаСодержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание разд
                ела 1...Содержание раздела 1...Содержание раздела 1...СодержаСодержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздел
                а 1...Содержание раздела 1...Содержание раздела 1...Содержание разделаСодержание раздеСодержание раздела 1...Содержание раздела 1...Содержание раздела 1...Сод
                Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содер
                жание раздела 1...Содержание раздела 1...Содержание разделаССодержание раздеСодержание раздела 1...Содержание раздела 1...Содержание раздела 1...Сод
                Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содер
                жание раздела 1...Содержание раздела 1...Содержание разделаССодержание раздеСодержание раздела 1...Содержание раздела 1...Содержание раздела 1...Сод
                Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содер
                жание раздела 1...Содержание раздела 1...Содержание разделаССодержание раздеСодержание раздела 1...Содержание раздела 1...Содержание раздела 1...Сод
                Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содер
                жание раздела 1...Содержание раздела 1...Содержание разделаССодержание раздеСодержание раздела 1...Содержание раздела 1...Содержание раздела 1...Сод
                Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содер
                жание раздела 1...Содержание раздела 1...Содержание разделаССодержание раздеСодержание раздела 1...Содержание раздела 1...Содержание раздела 1...Сод
                Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содер
                жание раздела 1...Содержание раздела 1...Содержание разделаССодержание раздеСодержание раздела 1...Содержание раздела 1...Содержание раздела 1...Сод
                Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содер
                жание раздела 1...Содержание раздела 1...Содержание разделаССодержание раздеСодержание раздела 1...Содержание раздела 1...Содержание раздела 1...Сод
                Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содер
                жание раздела 1...Содержание раздела 1...Содержание разделаССодержание раздеСодержание раздела 1...Содержание раздела 1...Содержание раздела 1...Сод
                Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содер
                жание раздела 1...Содержание раздела 1...Содержание разделаССодержание раздеСодержание раздела 1...Содержание раздела 1...Содержание раздела 1...Сод
                Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содер
                жание раздела 1...Содержание раздела 1...Содержание разделаС 1...ние раздела 1... 1...Содержание раздела 1...ержание раздела 1...Содержание раздела 1...Содержание раздела 1...Содержание раздела 1...ла 1......</p>
    
            <h2 id="section2" class="text-xl font-semibold mt-6">Раздел 2</h2>
            <p>Содержание раздела 2...</p>
    
            <h2 id="section3" class="text-xl font-semibold mt-6">Раздел 3</h2>
            <p>Содержание раздела 3...</p>
    
            <h2 id="section4" class="text-xl font-semibold mt-6">Раздел 4</h2>
            <p>Содержание раздела 4...</p>
        </div>
    </div>

</x-layout>